Revit 2024 API
StructuralSection.GetBoundarySize Method
 Returns size of the section boundary.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public UV GetBoundarySize()
Visual Basic
Public Function GetBoundarySize As UV
Visual C++
public:
UV^ GetBoundarySize()
Return Value
 Size of the section boundary.
See Also
StructuralSection Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace